"""
안녕하세요. 2일차에도 만나서 반갑습니다.

컴퓨터 기본 :
얘는 맨 처음엔 계산기로 나왔어요.
그러다가 여러가지 기능들이 붙었어요.
컴퓨터의 기본 기능은 산술연산, 제어문, 반복문

요런것들을 조합해서 일을 시킴

그래서, 우리가 상상 하는거만큼, 대단한 일을 하진 못함.
얘가 가진 장점은 무식하게 빠른 산술연산
???
챗 지피티는 뭔데...

얘도 사람이 알아듣는 문자나 이미지 같은것을 숫자로 어거지로 
끼워 맞춰서 연산 때리게 하고
컴퓨터의 숫자를 어거지로 사람이 알아듣는 방법으로 변환 시킨거다

오늘은 컴퓨터 프로그래밍에서 모든분야 공통으로 쓰이는 변수에 대해 알아보겠습니다.
수학에선 변하는 숫자 = x
그냥 수학개념에서 좀더 뭘 얻었어요

쉽게 얘기하면 박스
어렵게 얘기하면 메모리 공간 입니다
여기에 데이터를 담는게 변수입니다

컴퓨터 주요 부품
CPU - 메인 계산기
GPU - 특별한 계산기
메모리 - 아주 중요. 사람으로 치면 주머니
하드디스크 - 얘는 창고

변수는 데이터를 메모리에 저장 시키는 방법입니다.
"""
"""
수학에선 x 는 10이다
프로그래밍 언어에선, x 라는 박스에 10을 담았다
""" 
# x 라는 변수가 처음 등장. 이건 x 라는 변수를 선언한거에요
x=10 
# x 라는 변수가 예전에 등장 했고, 또 등장 했으니, 이번에는
# x 라는 박스의 내용물을 바꾼거에요
x=2

"""
코딩 하다가 밑에 빨간줄 같은게 생기면, 문법 에러가 있다는 뜻입니다
Statements must be separated by newlines or semicolons
"""
x x=10